---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricArea.Direction
source: html/b1176d0f-6911-da51-cdf9-7a6f1a185761.htm
---
# Autodesk.Revit.DB.Structure.FabricArea.Direction Property

The Major Direction of the Fabric Area.

## Syntax (C#)
```csharp
public XYZ Direction { get; }
```